/**
 * Інтерфейс Aggregate визначає методи для створення ітераторів.
 * <p>
 * Дозволяє колекції надавати ітератори для роботи з її елементами.
 * </p>
 */
interface Aggregate<T> {
    /**
     * Створює ітератор для послідовного доступу до елементів.
     * <p>
     * Обходить елементи у тому порядку, в якому вони були додані.
     * </p>
     * @return Ітератор для роботи з елементами колекції.
     */
    Iterator<T> createIterator();
    /**
     * Створює ітератор для доступу до елементів у відсортованому порядку.
     * @return Ітератор для відсортованих елементів.
     */
    Iterator<T> createSortedIterator();
}