/**
 * Інтерфейс Iterator дозволяє по черзі отримувати елементи з колекції.
 * <p>
 * Використовується, щоб обійти колекцію без необхідності знати, як вона реалізована.
 * </p>
 */
interface Iterator<T> {
    /**
     * Перевіряє, чи є ще елементи в колекції.
     * <p>
     * Цей метод визначає, чи залишились ще елементи у колекції, до яких можна отримати доступ
     * </p>
     * @return {@code true}, якщо є наступний елемент; {@code false}, якщо всі елементи пройдені.
     */
    boolean hasNext();
    /**
     * Повертає поточний елемент колекції та переміщує ітератор до наступного.
     * <p>
     * Якщо немає більше елементів, викидається виключення {@code java.util.NoSuchElementException}.
     * </p>
     * @return Поточний елемент.
     * @throws java.util.NoSuchElementException якщо немає більше елементів.
     */
    T next();
}